EDT/УТ/src/DataProcessors/РедактированиеГрафикаРейсов/РедактированиеГрафикаРейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеГрафикаРейсов</name>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>тчГрафик</name>
    <attributes>
      <name>Т</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольРейса</name>
      <type>
        <types>CatalogRef.РолиТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СменаПредыдущегоРейса</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Х</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Э</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйВодитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйЭкспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортВыйдетВРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МожноРедактировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РольДо</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифДо</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПосле</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПосле</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПеремещения</name>
      <type>
        <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыФизЛиц/ДополнительныеПараметрыФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыФизЛиц</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяРольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостояниеРаботникаОрганизации/СостояниеРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеРаботникаОрганизации</name>
  <enumValues>
    <name>ПринятНаРаботуВОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/новаВодители/новаВодители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаВодители</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентОпытности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наемный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТранспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТелефон</name>
    <type>
      <types>CatalogRef.новаКонтактнаяИнформация</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.новаКонтактнаяИнформация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПешийКурьер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДВнешнегоОператораМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОпытности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/РолиСотрудников/РолиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиСотрудников</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВечернийВодитель</name>
      <description>Вечерний водитель</description>
    </items>
    <items>
      <name>Водитель</name>
      <description>Водитель</description>
    </items>
    <items>
      <name>ДежурныйВодитель</name>
      <description>Дежурный водитель</description>
    </items>
    <items>
      <name>Диспетчер</name>
      <description>Диспетчер</description>
    </items>
    <items>
      <name>ЗаборныйВодитель</name>
      <description>Заборный водитель</description>
    </items>
    <items>
      <name>Логист</name>
      <description>Логист</description>
    </items>
    <items>
      <name>Магистраль</name>
      <description>Магистраль</description>
    </items>
    <items>
      <name>НаемныйВодитель</name>
      <description>Наемный водитель</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ПешийКурьер</name>
      <description>Пеший курьер</description>
    </items>
    <items>
      <name>Самовывоз</name>
      <description>Самовывоз</description>
    </items>
    <items>
      <name>Фрахты</name>
      <description>Фрахты</description>
    </items>
    <items>
      <name>ШтатныйВодитель</name>
      <description>Штатный водитель</description>
    </items>
    <items>
      <name>Экспедитор</name>
      <description>Экспедитор</description>
    </items>
  </predefined>
  <attributes>
    <name>ПредставлениеРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДолжность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыводаРоли</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветВыделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенВыборВРедактированииГрафикаРейсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВозможныеРоли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОсновныеНачисленияПоРегионам</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеНачисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/РедактированиеГрафикаРейсов/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаРедактирования = Параметры.ДатаРедактирования;
	Терминал = Параметры.Терминал;
	ИмяСправочника = Параметры.ИмяСправочника;
	ТекущийЭлементСписка = Параметры.ТекущийЭлемент;
	СписокИсключений.ЗагрузитьЗначения(Параметры.Исключения);
	ЗаголовокПоУмолчанию = Параметры.ЗаголовокФормы;
	Элементы.СписокВыбораНаименование.Заголовок = Параметры.ЗаголовокСсылки;
	Элементы.ФормаСотрудникиРоли.Заголовок = "Роль " + Параметры.ЗаголовокСсылки;
	Элементы.ФормаСотрудникиРоли.Пометка = Истина;
	
	ЗаполнитьСписок();
	
	//Если Параметры.Список.Количество() Тогда
	//	ИмяСправочника = Параметры.Список[0].Метаданные().Имя;
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("Список", Параметры.Список);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	НекийСправочник.Ссылка КАК Ссылка,
	//	|	НекийСправочник.Наименование КАК Наименование
	//	|ИЗ
	//	|	Справочник." + ИмяСправочника + " КАК НекийСправочник
	//	|ГДЕ
	//	|	НекийСправочник.Ссылка В(&Список)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Наименование";
	//	СписокВыбора.Загрузить(Запрос.Выполнить().Выгрузить());
	//КонецЕсли;
	//
	//ТекущиеСтроки = СписокВыбора.НайтиСтроки(Новый Структура("Ссылка", Параметры.ТекущийЭлемент));
	//Если ТекущиеСтроки.Количество() Тогда
	//	Элементы.СписокВыбора.ТекущаяСтрока = ТекущиеСтроки[0].ПолучитьИдентификатор();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписок()
	
	Если Элементы.ФормаСотрудникиРоли.Пометка Тогда
		Заголовок = ЗаголовокПоУмолчанию + " (" + Элементы.ФормаСотрудникиРоли.Заголовок + " на " + Формат(ДатаРедактирования, "ДФ=dd.MM.yyyy") + ")";
	Иначе
		Заголовок = ЗаголовокПоУмолчанию + " (все роли)";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРедактирования", КонецДня(ДатаРедактирования));
	Запрос.УстановитьПараметр("ТерминалДоставки", Терминал);
	Запрос.УстановитьПараметр("ТекущийЭлемент", ТекущийЭлементСписка);
	Запрос.УстановитьПараметр("Исключения", СписокИсключений.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СотрудникиРоли", Элементы.ФормаСотрудникиРоли.Пометка);
	Запрос.УстановитьПараметр("РавенствоРоли", ИмяСправочника = "новаЭкспедиторы");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	новаВодители.Ссылка КАК Ссылка,
	|	новаВодители.Наименование КАК Наименование
	|ИЗ
	|	Справочник.новаВодители КАК новаВодители
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЗ_МаксПериоды.Период КАК Период,
	|			ВЗ_МаксПериоды.ФизЛицо КАК ФизЛицо,
	|			МАКСИМУМ(РаботникиОрганизации.Регистратор) КАК Регистратор
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизации.Период) КАК Период,
	|					РаботникиОрганизации.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|				
	|				СГРУППИРОВАТЬ ПО
	|					РаботникиОрганизации.ФизЛицо) КАК ВЗ_МаксПериоды
	|				ПО РаботникиОрганизации.Период = ВЗ_МаксПериоды.Период
	|					И РаботникиОрганизации.ФизЛицо = ВЗ_МаксПериоды.ФизЛицо
	|					И (РаботникиОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВЗ_МаксПериоды.Период,
	|			ВЗ_МаксПериоды.ФизЛицо) КАК ВЗ_ПриемНаРаботу
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|			ПО ВЗ_ПриемНаРаботу.Период = РаботникиОрганизации.Период
	|				И ВЗ_ПриемНаРаботу.Регистратор = РаботникиОрганизации.Регистратор
	|				И ВЗ_ПриемНаРаботу.ФизЛицо = РаботникиОрганизации.ФизЛицо
	|		ПО новаВодители.ФизЛицо = ВЗ_ПриемНаРаботу.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыФизЛиц.СрезПоследних(&ДатаРедактирования, ) КАК ДополнительныеПараметрыФизЛицСрезПоследних
	|		ПО новаВодители.ФизЛицо = ДополнительныеПараметрыФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	НЕ новаВодители.ЭтоГруппа
	|	И новаВодители.Родитель.ТерминалДоставки = &ТерминалДоставки
	|	И НЕ новаВодители.Ссылка В (&Исключения)
	|	И ЕСТЬNULL(РаботникиОрганизации.Состояние, ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.Уволен)) = ЗНАЧЕНИЕ(Перечисление.СостояниеРаботникаОрганизации.ПринятНаРаботуВОрганизацию)
	|	И ВЫБОР
	|			КОГДА &СотрудникиРоли
	|				ТОГДА &РавенствоРоли
	|							И ЕСТЬNULL(ДополнительныеПараметрыФизЛицСрезПоследних.ОсновнаяРольСотрудника, ЗНАЧЕНИЕ(Справочник.РолиСотрудников.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РолиСотрудников.Экспедитор)
	|						ИЛИ НЕ &РавенствоРоли
	|							И ЕСТЬNULL(ДополнительныеПараметрыФизЛицСрезПоследних.ОсновнаяРольСотрудника, ЗНАЧЕНИЕ(Справочник.РолиСотрудников.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.РолиСотрудников.Экспедитор)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	новаВодители.Ссылка,
	|	новаВодители.Наименование
	|ИЗ
	|	Справочник.новаВодители КАК новаВодители
	|ГДЕ
	|	новаВодители.Ссылка = &ТекущийЭлемент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "новаВодители", ИмяСправочника);
	
	СписокВыбора.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ТекущиеСтроки = СписокВыбора.НайтиСтроки(Новый Структура("Ссылка", ТекущийЭлементСписка));
	Если ТекущиеСтроки.Количество() Тогда
		Элементы.СписокВыбора.ТекущаяСтрока = ТекущиеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначение(Команда)

	ТекущиеДанные = Элементы.СписокВыбора.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Закрыть(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВыбора.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Закрыть(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиРолиНаСервере()
	
	Элементы.ФормаСотрудникиРоли.Пометка = Не Элементы.ФормаСотрудникиРоли.Пометка;
	ЗаполнитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРоли(Команда)
	СотрудникиРолиНаСервере();
КонецПроцедуры
